#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.function_apps.azurerm_key_vault_secret.func_user_default_key will be created
  + resource "azurerm_key_vault_secret" "func_user_default_key" {
      + content_type            = "token"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + name                    = "funciowallet-KEY-APPBACKEND"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cosmos.module.wallet_cosmosdb_containers["nonces"].azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name        = "io-p-itn-wallet-cosno-01"
      + database_name       = "db"
      + default_ttl         = (known after apply)
      + id                  = (known after apply)
      + name                = "nonces"
      + partition_key_path  = "/id"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 2000
        }
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-01"
        name                                           = "io-p-itn-wallet-user-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (27 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_path                       = "/api/v1/health" -> "/api/v1/wallet/info"
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
